app/controllers/tasks_controller.rb

	def create
	  @task = Task.create(task_params)
---
INSERT INTO "tasks" ("completed", "created_at", "note", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed", "2018-10-28"], ["created_at", "2018-10-28 15:04:09.349805"], ["note", "Add new task2"], ["title", "Add new task2"], ["updated_at", "2018-10-28 15:04:09.349805"]]