app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 31]]
---
	def update
	  @task = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 10]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 10]]
SELECT "tasks".* FROM "tasks"
---
	def destroy
	  @task = Task.find(params[:id])
	  @task.destroy
	  @tasks = Task.all